# Pandas

Pandas is python module that makes data science easy and effective.

Weather dataset

Questions:
1. What was the maximum temperature in Nepal in the month of January?
2. On which days did it rains?
3. What was the average speed of wind during the month?

In [1]:
import pandas as pd

In [7]:
df = pd.read_csv('weatherdata.csv')
df.tail()

,date,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
361,27-12-2016,60,40,50.0,0,0,0
362,28-12-2016,40,34,37.0,0,0,0
363,29-12-2016,46,33,39.5,0.39,0,0
364,30-12-2016,40,33,36.5,0.01,T,0
365,31-12-2016,44,31,37.5,0,0,0

In [3]:
df.describe()

       maximum temperature  minimum temperature  average temperature
count           366.000000           366.000000           366.000000
mean             64.625683            49.806011            57.215847
std              18.041787            16.570747            17.124760
min              15.000000            -1.000000             7.000000
25%              50.000000            37.250000            44.000000
50%              64.500000            48.000000            55.750000
75%              81.000000            65.000000            73.500000
max              96.000000            81.000000            88.500000

In [5]:
# Get the maximum temperatures
df['maximum temperature'].max()

96

In [9]:
# list all Snowing Day
df['date'][df['snow fall'] == 'T']  # Fancy Indexing

11      12-1-2016
13      14-1-2016
17      18-1-2016
23      24-1-2016
39       9-2-2016
40      10-2-2016
41      11-2-2016
53      23-2-2016
79      20-3-2016
93       3-4-2016
94       4-4-2016
99       9-4-2016
324    20-11-2016
349    15-12-2016
364    30-12-2016
Name: date, dtype: object

# Dataframe Basics

Data frame is a main object in pandas. It is used to represent dat with rows and columns.

Data frame is a data structure that represents data in tabular or except spread sheet like data.

In [12]:
# List of tuples ----> Dataframe

weather_data = [('1/1/2017', 32, 6, 'Rain'),
                ('1/2/2017', 35, 7, 'Sunny'),
                ('1/3/2017', 28, 2, 'Snow'),
                ('1/4/2017', 24, 7, 'Snow'),
                ('1/5/2017', 32, 4, 'Rain'),
                ('1/6/2017', 31, 2, 'Sunny')
               ]
df = pd.DataFrame(weather_data, columns=['date', 'temperature', 'windspeed', 'event'])
df

       date  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [13]:
df.shape

(6, 4)

In [15]:
df.columns # returns list of column name in a dataframe

Index(['date', 'temperature', 'windspeed', 'event'], dtype='object')

In [18]:
df.date # print column data

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: date, dtype: object

In [19]:
# Another way of accessing column
df['date']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: date, dtype: object

In [22]:
df[['date', 'event']]

       date  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [23]:
df.temperature.max()

35

In [24]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [25]:
# select rows which has maximum temperature
df[df.temperature == df.temperature.max()]

       date  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [26]:
# Select only dat column which has maximum temperature
df.date[df.temperature == df.temperature.max()]

1    1/2/2017
Name: date, dtype: object

# Read and write CSV and XLS files

In [29]:
df = pd.read_csv('weatherdata.csv')
df.sample()

,date,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
78,19-3-2016,46,36,41.0,0.00,0.0,0

In [52]:
# Read excel file
df = pd.read_excel('weatherdata.xlsx')
df

       date  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [53]:
# write DF to csv
df.to_csv('new.csv', index=False)

In [54]:
# Write DF to Excel
df.to_excel("new_sheet.xlsx", sheet_name = "Weather Data")

# Group-By

In [56]:
df = pd.read_csv('weather_data_cities.csv')
df.sample()

        day    city  temperature  windspeed event
6  1/3/2017  mumbai           87         15   Fog

In [58]:
g = df.groupby('city')
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [59]:
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [60]:
# Find Maximum temperature in each of the cities
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [61]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [62]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatenate Data Frames

In [64]:
nepal_weather = pd.DataFrame({
    "city": ["kathmandu", "pokhara", "chitwan"],
    "temperature": [32, 45, 55],
    "humidity": [80,60, 35]
})
weather

        city  temperature  humidity
0  kathmandu           32        80
1    pokhara           45        60
2    chitwan           55        35

In [65]:
us_weather = pd.DataFrame({
    "city": ["new york", "chicago", "texas"],
    "temperature": [21, 14, 45],
    "humidity": [68, 65, 67]
})

In [66]:
df = pd.concat([nepal_weather, us_weather], ignore_index=True)
df

        city  temperature  humidity
0  kathmandu           32        80
1    pokhara           45        60
2    chitwan           55        35
3   new york           21        68
4    chicago           14        65
5      texas           45        67

In [67]:
df = pd.concat([nepal_weather, us_weather], axis=1)
df

        city  temperature  humidity      city  temperature  humidity
0  kathmandu           32        80  new york           21        68
1    pokhara           45        60   chicago           14        65
2    chitwan           55        35     texas           45        67

# Merge DataFrame

In [68]:
temperature_df = pd.DataFrame({
    "city": ['kathmandu', "pokhara", "chitwan", "biratnagar"],
    "temperature": [26, 27, 30, 30]
})

In [71]:
humidity_df = pd.DataFrame({
    "city": ["kathmandu", "pokhara", "chitwan"],
    "humidity": [56, 54, 177]
})

In [73]:
# merge two dataframe with out explicitly mentioning index
df = pd.merge(temperature_df, humidity_df, on='city')
df

        city  temperature  humidity
0  kathmandu           26        56
1    pokhara           27        54
2    chitwan           30       177

In [ ]:
# Outer j